cargodog/kinetis-sdk-mk8x/boards/twrk80f150m/usb_examples/usb_device_composite_hid_audio_unified_lite/bm/composite.c
void BOARD_Transfer_Mode_Config()
{
    BOARD_DMA_EDMA_Config();
    BOARD_Create_Audio_DMA_EDMA_Handle();
    BOARD_DMA_EDMA_Set_AudioFormat();
    BOARD_DMA_EDMA_Enable_Audio_Interrupts();
    BOARD_DMA_EDMA_Start();
}

void SAI_UserTxIRQHandler(void)
{
    /* Clear the FEF flag */
    SAI_TxClearStatusFlags(BOARD_DEMO_SAI, kSAI_FIFOErrorFlag);
    SAI_TxSoftwareReset(BOARD_DEMO_SAI, kSAI_ResetTypeFIFO);
    /* Add for ARM errata 838869, affects Cortex-M4, Cortex-M4F Store immediate overlapping
        exception return operation might vector to incorrect interrupt */
    __DSB();
}

void SAI_UserRxIRQHandler(void)
{
    SAI_RxClearStatusFlags(BOARD_DEMO_SAI, kSAI_FIFOErrorFlag);
    SAI_RxSoftwareReset(BOARD_DEMO_SAI, kSAI_ResetTypeFIFO);
    /* Add for ARM errata 838869, affects Cortex-M4, Cortex-M4F Store immediate overlapping
        exception return operation might vector to incorrect interrupt */
    __DSB();
}
#endif

#if AUDIO_INTERRUPT_IRQ_MODE
void BOARD_Interrupt_Set_AudioFormat()
{
    uint32_t mclkSourceClockHz = 0U;
    mclkSourceClockHz          = CLOCK_GetFreq(BOARD_DEMO_SAI_CLKSRC);

    SAI_TxSetFormat(BOARD_DEMO_SAI, &audioFormat, mclkSourceClockHz, audioFormat.masterClockHz);
    SAI_RxSetFormat(BOARD_DEMO_SAI, &audioFormat, mclkSourceClockHz, audioFormat.masterClockHz);
}

void BOARD_Enable_Audio_Interrupts()
{
    NVIC_SetPriority((IRQn_Type)DEMO_SAI_IRQ_TX, USB_DEVICE_INTERRUPT_PRIORITY - 1);
    NVIC_SetPriority((IRQn_Type)DEMO_SAI_IRQ_RX, USB_DEVICE_INTERRUPT_PRIORITY - 1);
    /*  Enable interrupt */
    EnableIRQ(DEMO_SAI_IRQ_TX);
    EnableIRQ(DEMO_SAI_IRQ_RX);
    SAI_TxEnableInterrupts(BOARD_DEMO_SAI, kSAI_FIFOWarningInterruptEnable | kSAI_FIFOErrorInterruptEnable);
    SAI_RxEnableInterrupts(BOARD_DEMO_SAI, kSAI_FIFOWarningInterruptEnable | kSAI_FIFOErrorInterruptEnable);
    SAI_TxEnable(BOARD_DEMO_SAI, true);
    SAI_RxEnable(BOARD_DEMO_SAI, true);
}

void SAI_TxIRQHandler(void)
{
    uint32_t data = 0;
    uint8_t i, j = 0;
    uint32_t temp = 0;

    /* Clear the FIFO error flag */
    if (SAI_TxGetStatusFlag(BOARD_DEMO_SAI) & kSAI_FIFOErrorFlag)
    {
        SAI_TxClearStatusFlags(BOARD_DEMO_SAI, kSAI_FIFOErrorFlag);
    }

    if (SAI_TxGetStatusFlag(BOARD_DEMO_SAI) & kSAI_FIFOWarningFlag)
    {
        for (i = 0; i < FSL_FEATURE_SAI_FIFO_COUNT; i++)
        {
            data = 0;
            if (g_composite.audioUnified.startPlayHalfFull)
            {
                for (j = 0; j < DEMO_SAI_BITWIDTH / 8U; j++)
                {
                    temp = (uint32_t)(audioPlayDataBuff[g_composite.audioUnified.tdWriteNumberPlay]);
                    data |= (temp << (8U * j));
                    g_composite.audioUnified.tdWriteNumberPlay++;
                    g_composite.audioUnified.audioSendCount++;
                }
                if (g_composite.audioUnified.tdWriteNumberPlay >=
                    AUDIO_SPEAKER_DATA_WHOLE_BUFFER_LENGTH * FS_ISO_OUT_ENDP_PACKET_SIZE)
                {
                    g_composite.audioUnified.tdWriteNumberPlay = 0;
                }
            }
            else if (g_composite.audioUnified.startPlay)
            {
                for (j = 0; j < DEMO_SAI_BITWIDTH / 8U; j++)
                {
                    g_composite.audioUnified.audioSendCount++;
                }
                data = 0;
            }
            else
            {
                data = 0;
            }
            SAI_WriteData(BOARD_DEMO_SAI, SAI_IRQ_CHANNEL, data);
        }
    }
}

void SAI_RxIRQHandler(void)
{
    uint32_t data = 0;
    uint8_t i, j = 0;

    /* Clear the FIFO error flag */
    if (SAI_RxGetStatusFlag(BOARD_DEMO_SAI) & kSAI_FIFOErrorFlag)
    {
        SAI_RxClearStatusFlags(BOARD_DEMO_SAI, kSAI_FIFOErrorFlag);
    }

    if (SAI_RxGetStatusFlag(BOARD_DEMO_SAI) & kSAI_FIFOWarningFlag)
    {
        for (i = 0; i < FSL_FEATURE_SAI_FIFO_COUNT; i++)
        {
            data = SAI_ReadData(BOARD_DEMO_SAI, SAI_IRQ_CHANNEL);
            if (g_composite.audioUnified.startRec)
            {
                for (j = 0; j < DEMO_SAI_BITWIDTH / 8U; j++)
                {
                    audioRecDataBuff[g_composite.audioUnified.tdReadNumberRec] = (data >> (8U * j));
                    g_composite.audioUnified.tdReadNumberRec++;
                    g_composite.audioUnified.audioRecvCount++;
                }
                if (g_composite.audioUnified.tdReadNumberRec >=
                    AUDIO_RECORDER_DATA_WHOLE_BUFFER_LENGTH * FS_ISO_IN_ENDP_PACKET_SIZE)
                {
                    g_composite.audioUnified.tdReadNumberRec = 0;
                }
            }
        }
    }
}
#endif

void USB0_IRQHandler(void)
{
    USB_DeviceKhciIsrFunction(g_composite.deviceHandle);
    /* Add for ARM errata 838869, affects Cortex-M4, Cortex-M4F Store immediate overlapping
        exception return operation might vector to incorrect interrupt */
    __DSB();
}
void USB_DeviceClockInit(void)
{
    SystemCoreClockUpdate();
    CLOCK_EnableUsbfs0Clock(kCLOCK_UsbSrcIrc48M, 48000000U);
}
void USB_DeviceIsrEnable(void)
{
    uint8_t irqNumber;

    uint8_t usbDeviceKhciIrq[] = USB_IRQS;
    irqNumber                  = usbDeviceKhciIrq[CONTROLLER_ID - kUSB_ControllerKhci0];

    /* Install isr, set priority, and enable IRQ. */
    NVIC_SetPriority((IRQn_Type)irqNumber, USB_DEVICE_INTERRUPT_PRIORITY);
    EnableIRQ((IRQn_Type)irqNumber);
}
#if USB_DEVICE_CONFIG_USE_TASK
void USB_DeviceTaskFn(void *deviceHandle)
{
    USB_DeviceKhciTaskFunction(deviceHandle);
}
#endif

/*!
 * @brief USB device callback function.
 *
 * This function handles the usb device specific requests.
 *
 * @param handle		  The USB device handle.
 * @param event 		  The USB device event type.
 * @param param 		  The parameter of the device specific request.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
usb_status_t USB_DeviceCallback(usb_device_handle handle, uint32_t event, void *param)
{
    usb_status_t error = kStatus_USB_Error;
    uint8_t *temp8 = (uint8_t *)param;

